0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version: 8                                      |
|   \  /    A nd           |                                                 |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
dimensions      [0 2 -3 0 0 0 0];
internalField   uniform 0.09;
boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.09;
    }
    outlet
    {
        type            zeroGradient;
    }
    nosecone
    {
        type epsilonWallFunction;
        value uniform 0.01;
    }
    sides
    {
        type            epsilonWallFunction;
    }
}
