0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version: 8                                      |
|   \  /    A nd           |                                                 |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 1e-5;
boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1e-5;
    }
    outlet
    {
        type            zeroGradient;
    }
    sides
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    nosecone
    {
        type nutkWallFunction;
        value uniform 0;
    }
}
