0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version: 8                                      |
|   \  /    A nd           | Web:      https://openfoam.org                  |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 20;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 20;
    }

    outlet
    {
        type            zeroGradient;
    }
    nosecone
    {
        type omegaWallFunction;
        value uniform 10;
    }

    sides
    {
        type            omegaWallFunction;
        value           uniform 20;
    }
}
