constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          6000;
        startFace       1064400;
    }
    outlet
    {
        type            patch;
        nFaces          6000;
        startFace       1070400;
    }
    sides
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          19200;
        startFace       1076400;
    }
)

// ************************************************************************* //
